### Terraform :rocket:
#### Terraform init
```bash
Initializing the backend...

Successfully configured the backend "azurerm"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing modules...
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for aca_cocktails_mcp...
- aca_cocktails_mcp in .terraform/modules/aca_cocktails_mcp/modules/container-app
Downloading git::ssh://git@github.com/mtnvencenzo/Terraform-Modules.git for apim_cocktails_mcp...
- apim_cocktails_mcp in .terraform/modules/apim_cocktails_mcp/modules/apim-api
- mcp_b2c_tenant in b2c_tenant
Initializing provider plugins...
- Finding hashicorp/azurerm versions matching "4.24.0"...
- Finding hashicorp/azuread versions matching "3.1.0"...
- Finding latest version of hashicorp/random...
- Installing hashicorp/random v3.7.2...
- Installed hashicorp/random v3.7.2 (signed by HashiCorp)
- Installing hashicorp/azurerm v4.24.0...
- Installed hashicorp/azurerm v4.24.0 (signed by HashiCorp)
- Installing hashicorp/azuread v3.1.0...
- Installed hashicorp/azuread v3.1.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```
#### Terraform format
```bash

```
#### Terraform validate
```bash

Warning: Argument is deprecated

  with module.mcp_b2c_tenant.azuread_service_principal_password.cocktails_mcp_app_registration_graph_api_secret,
  on b2c_tenant/api_app_registration.tf line 87, in resource "azuread_service_principal_password" "cocktails_mcp_app_registration_graph_api_secret":
  87:   end_date_relative    = "2yr"

The `end_date_relative` property is deprecated and will be removed in a
future version of the AzureAD provider. Please instead use the Terraform
`timeadd()` function to calculate a value for the `end_date` property.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```
#### Terraform plan
```bash
random_password.cocktails_mcp_localusage_subscription_keys[0]: Refreshing state... [id=none]
random_password.cocktails_mcp_apimhostkey: Refreshing state... [id=none]
random_password.cocktails_mcp_cezzis_com_subscription_keys[0]: Refreshing state... [id=none]
random_password.cocktails_mcp_devops_subscription_keys[0]: Refreshing state... [id=none]
random_password.cocktails_mcp_localusage_subscription_keys[1]: Refreshing state... [id=none]
random_password.cocktails_mcp_devops_subscription_keys[1]: Refreshing state... [id=none]
random_password.cocktails_mcp_cezzis_com_subscription_keys[1]: Refreshing state... [id=none]
module.mcp_b2c_tenant.data.azuread_application_published_app_ids.well_known: Reading...
module.mcp_b2c_tenant.data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
data.azurerm_resource_group.cocktails_global_resource_group: Reading...
data.azurerm_resource_group.cocktails_resource_group: Reading...
data.azurerm_resource_group.global_network_resource_group: Reading...
data.azurerm_resource_group.global_shared_resource_group: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_application_insights.appi: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjBhZTE4MC0zNWM4LTQ1ODktYTlkMS1iNjNkOWZkYzhmZmM7b2JqZWN0SWQ9ZmZlZmFiYWMtZmRhNC00ZTVkLWFlZTUtYWZlNTBkYzdkYTkzO3N1YnNjcmlwdGlvbklkPTFkOWVjYzAwLTI0MmEtNDYwZC04YjA4LWI3MWRiMTlmMDk0ZTt0ZW5hbnRJZD1hYmM0OTBlNS0zOTViLTRkYjEtOWQ5Zi0xODQzNGE0NTI2M2Q=]
data.azurerm_resource_group.global_shared_resource_group: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001]
data.azurerm_api_management.apim_shared: Reading...
data.azurerm_container_registry.shared_acr: Reading...
data.azurerm_container_app_environment.cae_shared: Reading...
data.azurerm_resource_group.global_network_resource_group: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001]
data.azurerm_virtual_network.global_virtual_network: Reading...
data.azurerm_subnet.container_app_environment_subnet: Reading...
data.azurerm_application_insights.appi: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.Insights/components/appi-vec-eus-glo-shared-001]
data.azurerm_resource_group.cocktails_global_resource_group: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001]
data.azurerm_dns_zone.cezzis_dns_zone: Reading...
data.azurerm_resource_group.cocktails_resource_group: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001]
data.azurerm_key_vault.cocktails_keyvault: Reading...
module.aca_cocktails_mcp.azurerm_user_assigned_identity.aca_user_identity: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mi-vec-eus-prd-cocktailsmcp-001]
data.azurerm_api_management.apim_shared: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001]
module.apim_cocktails_mcp.azurerm_api_management_api_version_set.apim_api_version_set: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/apiVersionSets/prd-cocktails-mcp]
module.apim_cocktails_mcp.azurerm_api_management_product.apim_api_product[0]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/products/prd-cocktails-mcp]
module.apim_cocktails_mcp.azurerm_api_management_logger.apim_appinsights_logger[0]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/loggers/prd-cocktails-mcp-appinsights-logger]
data.azurerm_subnet.container_app_environment_subnet: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001/providers/Microsoft.Network/virtualNetworks/vnet-vec-eus-glo-network-001/subnets/snet-vec-eus-glo-sharedcontainers-001]
data.azurerm_virtual_network.global_virtual_network: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-network-001/providers/Microsoft.Network/virtualNetworks/vnet-vec-eus-glo-network-001]
data.azurerm_key_vault.cocktails_keyvault: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-prd-cockti-1]
azurerm_key_vault_secret.cocktails_mcp_apimhostkey: Refreshing state... [id=https://kv-vec-eus-prd-cockti-1.vault.azure.net/secrets/cocktails-mcp-apimhostkey/6fdd7e71cd83426dab3a327304348a87]
azurerm_key_vault_secret.cocktails_mcp_devops_subscription_primary_key: Refreshing state... [id=https://kv-vec-eus-prd-cockti-1.vault.azure.net/secrets/cocktails-mcp-devops-subscription-primary-key/6538dd1c26224b49aa6669cad4508076]
azurerm_key_vault_secret.cocktails_mcp_cezzis_com_subscription_primary_key: Refreshing state... [id=https://kv-vec-eus-prd-cockti-1.vault.azure.net/secrets/cocktails-mcp-cezzis-com-subscription-primary-key/ed80ee3c5d25499287f1922da6452691]
data.azurerm_dns_zone.cezzis_dns_zone: Read complete after 0s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-cocktails-001/providers/Microsoft.Network/dnsZones/cezzis.com]
data.azurerm_key_vault_secret.cocktails_api_mcp_subscription_key: Reading...
module.aca_cocktails_mcp.azurerm_key_vault_access_policy.aca_keyvault_policy[0]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.KeyVault/vaults/kv-vec-eus-prd-cockti-1/objectId/8fc4dc62-3dd1-49d6-9495-4d6c5b1cb438]
module.apim_cocktails_mcp.azurerm_api_management_subscription.apim_api_product_subscriptions["Prd Cezzis.Com Standard Cocktails Mcp Subscription"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/subscriptions/prd-cezzis-com-standard-cocktails-mcp-subscription]
module.apim_cocktails_mcp.azurerm_api_management_subscription.apim_api_product_subscriptions["Prd Cezzis.Com Devops Cocktails Mcp Subscription"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/subscriptions/prd-cezzis-com-devops-cocktails-mcp-subscription]
module.apim_cocktails_mcp.azurerm_api_management_subscription.apim_api_product_subscriptions["Prd Cezzis.Com LocalUsage Cocktails Mcp Subscription"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/subscriptions/prd-cezzis-com-localusage-cocktails-mcp-subscription]
data.azurerm_container_registry.shared_acr: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ContainerRegistry/registries/acrveceusgloshared001]
module.aca_cocktails_mcp.azurerm_role_assignment.aca_user_identity_acr_role_assignment: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ContainerRegistry/registries/acrveceusgloshared001/providers/Microsoft.Authorization/roleAssignments/248d9925-c510-2137-d404-741a531774da]
module.apim_cocktails_mcp.azurerm_api_management_named_value.apim_api_backend_named_value_apimhostkey: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/namedValues/prd-cocktails-mcp-apimhostkey]
data.azurerm_container_app_environment.cae_shared: Read complete after 1s [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.App/managedEnvironments/cae-vec-eus-glo-shared-001]
data.azurerm_key_vault_secret.cocktails_api_mcp_subscription_key: Read complete after 1s [id=https://kv-vec-eus-prd-cockti-1.vault.azure.net/secrets/cocktails-api-mcp-subscription-primary-key/d0c3f954184e4b108dc02d510006c4f2]
module.aca_cocktails_mcp.azurerm_container_app.aca: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.App/containerApps/aca-vec-eus-prd-cocktailsmcp-001]
module.apim_cocktails_mcp.azurerm_api_management_api.apim_api_version: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/apis/prd-cocktails-mcp-v1;rev=v1]
module.apim_cocktails_mcp.azurerm_api_management_backend.apim_api_backend: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/backends/prd-cocktails-mcp-backend]
module.apim_cocktails_mcp.azurerm_api_management_product_api.apim_api_product_api[0]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/products/prd-cocktails-mcp/apis/prd-cocktails-mcp-v1]
module.apim_cocktails_mcp.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/version"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/apis/prd-cocktails-mcp-v1/operations/v1-get-get-version]
module.apim_cocktails_mcp.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/healthz"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/apis/prd-cocktails-mcp-v1/operations/v1-get-get-health-status]
module.apim_cocktails_mcp.azurerm_api_management_api_operation.apim_api_version_operations["v1_POST_/mcp"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/apis/prd-cocktails-mcp-v1/operations/v1-post-post-mcp]
module.apim_cocktails_mcp.azurerm_api_management_api_diagnostic.apim_api_diagnostic[0]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/apis/prd-cocktails-mcp-v1/diagnostics/applicationinsights]
module.apim_cocktails_mcp.azurerm_api_management_api_operation.apim_api_version_operations["v1_GET_/mcp"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/apis/prd-cocktails-mcp-v1/operations/v1-get-get-mcp]
module.apim_cocktails_mcp.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/version"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/apis/prd-cocktails-mcp-v1/operations/v1-get-get-version]
module.apim_cocktails_mcp.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/mcp"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/apis/prd-cocktails-mcp-v1/operations/v1-get-get-mcp]
module.apim_cocktails_mcp.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_GET_/healthz"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/apis/prd-cocktails-mcp-v1/operations/v1-get-get-health-status]
module.apim_cocktails_mcp.azurerm_api_management_api_operation_policy.apim_api_version_operations_policy["v1_POST_/mcp"]: Refreshing state... [id=/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-glo-shared-001/providers/Microsoft.ApiManagement/service/apim-vec-eus-glo-shared-001/apis/prd-cocktails-mcp-v1/operations/v1-post-post-mcp]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aca_cocktails_mcp.azurerm_container_app.aca will be updated in-place
  ~ resource "azurerm_container_app" "aca" {
        id                            = "/subscriptions/1d9ecc00-242a-460d-8b08-b71db19f094e/resourceGroups/rg-vec-eus-prd-cocktails-001/providers/Microsoft.App/containerApps/aca-vec-eus-prd-cocktailsmcp-001"
        name                          = "aca-vec-eus-prd-cocktailsmcp-001"
        tags                          = {
            "Application" = "cocktails"
            "Environment" = "prd"
            "Owner"       = "cocktails.mcp"
            "Product"     = "cezzis"
        }
        # (10 unchanged attributes hidden)

      ~ template {
            # (4 unchanged attributes hidden)

          ~ container {
              ~ image             = "acrveceusgloshared001.azurecr.io/cocktailsmcp:5f1db7379e92c98c78da1ec1aba8373f7bed969c" -> "acrveceusgloshared001.azurecr.io/cocktailsmcp:cb5ca0e216c9aad344a61db6b7bc423ec9f24f8f"
                name              = "cocktails-mcp"
                # (5 unchanged attributes hidden)

              ~ env {
                  ~ name        = (sensitive value)
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
              ~ env {
                  ~ name        = (sensitive value)
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
              ~ env {
                  ~ name        = (sensitive value)
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
              ~ env {
                  ~ name        = (sensitive value)
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
              ~ env {
                  ~ name        = (sensitive value)
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
              ~ env {
                  ~ name        = (sensitive value)
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
              ~ env {
                  ~ name        = (sensitive value)
                  ~ value       = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
              ~ env {
                  # Warning: this attribute value will be marked as sensitive and will not
                  # display in UI output after applying this change.
                  ~ name        = (sensitive value)
                  - secret_name = "apim-cocktails-api-subscription-key" -> null
                  + value       = (sensitive value)
                }
              ~ env {
                  ~ name        = "CocktailsMcp__ApimHostKey" -> "COCKTAILS_API_XKEY"
                  ~ secret_name = "apim-host-key" -> "apim-cocktails-api-subscription-key"
                    # (1 unchanged attribute hidden)
                }
              + env {
                  + name        = "CocktailsMcp__ApimHostKey"
                  + secret_name = "apim-host-key"
                }

                # (4 unchanged blocks hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.mcp_b2c_tenant.azuread_app_role_assignment.cocktails_mcp_app_registration_serviceprincipal_app_rw_all_role_assignment will be created
  + resource "azuread_app_role_assignment" "cocktails_mcp_app_registration_serviceprincipal_app_rw_all_role_assignment" {
      + app_role_id            = (known after apply)
      + id                     = (known after apply)
      + principal_display_name = (known after apply)
      + principal_object_id    = (known after apply)
      + principal_type         = (known after apply)
      + resource_display_name  = (known after apply)
      + resource_object_id     = (known after apply)
    }

  # module.mcp_b2c_tenant.azuread_application.cocktails_mcp_app_registration will be created
  + resource "azuread_application" "cocktails_mcp_app_registration" {
      + app_role_ids                   = (known after apply)
      + client_id                      = (known after apply)
      + disabled_by_microsoft          = (known after apply)
      + display_name                   = "appr-vec-eus-prd-cocktailsmcp-001"
      + fallback_public_client_enabled = true
      + id                             = (known after apply)
      + identifier_uris                = [
          + "https://cezzis.onmicrosoft.com/cocktailsmcp",
        ]
      + logo_url                       = (known after apply)
      + oauth2_permission_scope_ids    = (known after apply)
      + object_id                      = (known after apply)
      + prevent_duplicate_names        = false
      + publisher_domain               = (known after apply)
      + sign_in_audience               = "AzureADMyOrg"
      + tags                           = (known after apply)
      + template_id                    = (known after apply)

      + feature_tags (known after apply)

      + required_resource_access {
          + resource_app_id = "8f42e92c-e1ed-40f2-be13-3335af105d36"

          + resource_access {
              + id   = "771e9640-5432-2f31-d214-15c9206a8665"
              + type = "Scope"
            }
          + resource_access {
              + id   = "6898f74f-921d-18da-e885-920448ff1914"
              + type = "Scope"
            }
        }
      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = (known after apply)
              + type = "Role"
            }
          + resource_access {
              + id   = (known after apply)
              + type = "Role"
            }
          + resource_access {
              + id   = "37f7f235-527c-4136-accd-4a02d197296e"
              + type = "Scope"
            }
          + resource_access {
              + id   = "7427e0e9-2fba-42fe-b0c0-848c9e6a8182"
              + type = "Scope"
            }
        }

      + web {
          + redirect_uris = [
              + "http://localhost:6098/callback",
              + "https://aca-vec-eus-prd-cocktailsmcp-001.azurecontainerapps.io/callback",
            ]

          + implicit_grant {
              + access_token_issuance_enabled = true
              + id_token_issuance_enabled     = true
            }
        }
    }

  # module.mcp_b2c_tenant.azuread_service_principal.cocktails_mcp_app_registration_serviceprincipal will be created
  + resource "azuread_service_principal" "cocktails_mcp_app_registration_serviceprincipal" {
      + account_enabled              = true
      + app_role_assignment_required = false
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_tenant_id        = (known after apply)
      + client_id                    = (known after apply)
      + description                  = "Service principal for the appr-vec-eus-prd-cocktailsmcp-001"
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = (known after apply)
      + type                         = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # module.mcp_b2c_tenant.azuread_service_principal.msgraph will be created
  + resource "azuread_service_principal" "msgraph" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = "00000003-0000-0000-c000-000000000000"
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)
      + use_existing                = true

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # module.mcp_b2c_tenant.azuread_service_principal_password.cocktails_mcp_app_registration_graph_api_secret will be created
  + resource "azuread_service_principal_password" "cocktails_mcp_app_registration_graph_api_secret" {
      + display_name         = "cocktails-mcp-graph-client-secret"
      + end_date             = (known after apply)
      + end_date_relative    = "2yr"
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # module.mcp_b2c_tenant.random_uuid.cocktails_mcp_read_own_account_scope_id will be created
  + resource "random_uuid" "cocktails_mcp_read_own_account_scope_id" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.mcp_b2c_tenant.random_uuid.cocktails_mcp_write_own_account_scope_id will be created
  + resource "random_uuid" "cocktails_mcp_write_own_account_scope_id" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 7 to add, 1 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.mcp_b2c_tenant.azuread_service_principal_password.cocktails_mcp_app_registration_graph_api_secret,
  on b2c_tenant/api_app_registration.tf line 87, in resource "azuread_service_principal_password" "cocktails_mcp_app_registration_graph_api_secret":
  87:   end_date_relative    = "2yr"

The `end_date_relative` property is deprecated and will be removed in a
future version of the AzureAD provider. Please instead use the Terraform
`timeadd()` function to calculate a value for the `end_date` property.

(and one more similar warning elsewhere)

```

*This is a comment created by the terraform-plan-and-apply.yaml workflow. It will be updated if the workflow is run again.*